Revit 2027 API
ElectricalSystem Class
 Provides access to the Electrical System in Autodesk Revit MEP.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.MEPSystem
 Autodesk.Revit.DB.Electrical.ElectricalSystem
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class ElectricalSystem : MEPSystem
Public Class ElectricalSystem
	Inherits MEPSystem
public ref class ElectricalSystem : public MEPSystem
type ElectricalSystem =
    class
        inherit MEPSystem
    end
The ElectricalSystem type exposes the following members.
Properties
Name | Description
ApparentCurrent |  The ApparentCurrent value of the Electrical System.
ApparentCurrentPhaseA |  The ApparentCurrentPhaseA value of the Electrical System.
ApparentCurrentPhaseB |  The ApparentCurrentPhaseB value of the Electrical System.
ApparentCurrentPhaseC |  The ApparentCurrentPhaseC value of the Electrical System.
ApparentLoad |  The ApparentLoad value of the Electrical System.
ApparentLoadPhaseA |  The ApparentLoadPhaseA value of the Electrical System.
ApparentLoadPhaseB |  The ApparentLoadPhaseB value of the Electrical System.
ApparentLoadPhaseC |  The ApparentLoadPhaseC value of the Electrical System.
AssemblyInstanceId |  The id of the assembly instance to which the element belongs.
(Inherited from Element)
BalancedLoad |  Reports whether the BalancedLoad is on or off.
BaseEquipment | The base panel or equipment of the system.
(Inherited from MEPSystem)
BaseEquipmentConnector | The connector within base equipment which is used to connect with system.
(Inherited from MEPSystem)
BoundingBox | Retrieves a box that circumscribes all geometry of the element.
(Inherited from Element)
CableSize |  The Cable Size of the Electrical System.
CableType |  The Cable Type of the Electrical System.
Category | Retrieves a Category object that represents the category or sub category in which the element resides.
(Inherited from Element)
CircuitConnectionType |  The circuit connection type of the electrical system.
CircuitNamingIndex |  The Circuit Naming Index where the Electrical System is located in its panel. The Circuit Naming Index is used to retrieve the Circuit Naming Index of the Electrical System.
CircuitNumber |  The CircuitNumber of the Electrical System.
CircuitPathMode |  The circuit path mode of the electrical system.
CircuitType |  The circuit type of the Electrical System.
ConnectorManager | Connector manager of the system.
(Inherited from MEPSystem)
CreatedPhaseId |  Id of a Phase at which the Element was created.
(Inherited from Element)
DemolishedPhaseId |  Id of a Phase at which the Element was demolished.
(Inherited from Element)
DesignOption | Returns the design option to which the element belongs.
(Inherited from Element)
Document | Returns the Document in which the Element resides.
(Inherited from Element)
Elements | Terminal elements in the system.
(Inherited from MEPSystem)
Frame |  The Frame value of the Electrical System.
Geometry | Retrieves the geometric representation of the element.
(Inherited from Element)
GroundConductorSize |  The size of a Ground Conductor in the Electrical System.
GroundConductorsNumber |  The GroundConductors Number of the Electrical System.
GroupId |  The id of the group to which an element belongs.
(Inherited from Element)
HasCustomCircuitPath |  Checks whether the electrical system circuit path has been customized. If not, the property CircuitPathMode cannot be set as Custom explicitly.
HasDesignParts |  Indicates if the system has one or more design parts.
(Inherited from MEPSystem)
HasFabricationParts |  Indicates if the system has one or more fabrication parts.
(Inherited from MEPSystem)
HasPathOffset |  Whether the circuit path has a valid offset.
HasPlaceholders |  Indicates if the system has one or more placeholders.
(Inherited from MEPSystem)
HotConductorSize |  The size of a Hot Conductor in the Electrical System.
HotConductorsNumber |  The HotConductors Number of the Electrical System.
Id |  A unique identifier for an Element in an Autodesk Revit project.
(Inherited from Element)
IsBasePanelFeedThroughLugsOccupied |  Checks if the feed through lugs of the base panel is already occupied.
IsEmpty |  Indicates if the system is empty or not.
(Inherited from MEPSystem)
IsModifiable |  Identifies if the element is modifiable.
(Inherited from Element)
IsMultipleNetwork |  Indicates if the system is well connected or not. The flag will enable the "Divide System" button.
(Inherited from MEPSystem)
IsTransient |  Indicates whether an element is transient or permanent.
(Inherited from Element)
IsValid |  Indicates if the system is valid or not. atom AtomValidateSystem default false
(Inherited from MEPSystem)
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
(Inherited from Element)
Length |  The Length value of the Electrical System.
LevelId |  The id of the level associated with the element.
(Inherited from Element)
LoadClassificationAbbreviations |  The LoadClassification Abbreviations used in the Electrical System.
LoadClassifications |  The LoadClassifications used in the Electrical System.
LoadName |  The LoadName of the Electrical System.
Location | This property is used to find the physical location of an element within a project.
(Inherited from Element)
Name | A human readable name for the Element.
(Inherited from Element)
NeutralConductorSize |  The size of a Neutral Conductor in the Electrical System.
NeutralConductorsNumber |  The NeutralConductors Number of the Electrical System.
OtherConductorSize |  The size of an Other Conductor in the Electrical System.
OtherConductorsNumber |  The OtherConductors Number of the Electrical System.
OwnerViewId |  The id of the view that owns the element.
(Inherited from Element)
PanelName |  The Panel name of the Electrical System.
Parameter[BuiltInParameter] | Retrieves a parameter from the element given a parameter id.
(Inherited from Element)
Parameter[Definition] | Retrieves a parameter from the element based on its definition.
(Inherited from Element)
Parameter[Guid] | Retrieves a parameter from the element given a GUID for a shared parameter.
(Inherited from Element)
Parameters | Retrieves a set containing all of the parameters that are contained within the element.
(Inherited from Element)
ParametersMap | Retrieves a map containing all of the parameters that are contained within the element.
(Inherited from Element)
PathOffset |  The offset of the horizontal segments of the circuit path.
PhaseLabel |  The circuit phase label used in the Electrical System.
Pinned |  Identifies if the element has been pinned to prevent changes.
(Inherited from Element)
PolesNumber |  The Poles Number of the Electrical System.
PowerFactor |  The PowerFactor value of the Electrical System.
PowerFactorState |  The PowerFactorState type of the Electrical System.
PressureLossOfCriticalPath |  The total pressure loss of the sections in critical path.
(Inherited from MEPSystem)
Rating |  The Rating value of the Electrical System.
RunsNumber |  The Runs Number of the Electrical System.
SectionsCount |  The number of sections.
(Inherited from MEPSystem)
SlotIndex |  The Slots where the Electrical System is located in its panel.
StartSlot |  The Start Slot where the Electrical System is located in its panel.
SystemType |  The Electrical System Type of the Electrical System.
TrueCurrent |  The TrueCurrent value of the Electrical System.
TrueCurrentPhaseA |  The TrueCurrentPhaseA value of the Electrical System.
TrueCurrentPhaseB |  The TrueCurrentPhaseB value of the Electrical System.
TrueCurrentPhaseC |  The TrueCurrentPhaseC value of the Electrical System.
TrueLoad |  The TrueLoad value of the Electrical System.
TrueLoadPhaseA |  The TrueLoadPhaseA value of the Electrical System.
TrueLoadPhaseB |  The TrueLoadPhaseB value of the Electrical System.
TrueLoadPhaseC |  The TrueLoadPhaseC value of the Electrical System.
UniqueId |  A stable unique identifier for an element within the document.
(Inherited from Element)
VersionGuid |  Get the element version Guid.
(Inherited from Element)
ViewSpecific |  Identifies if the element is owned by a view.
(Inherited from Element)
Voltage |  The Voltage value of the Electrical System.
Ways |  The circuit ways used in the Electrical System.
WorksetId |  Get Id of the Workset which owns the element.
(Inherited from Element)
Top
Methods
Name | Description
Add |  Add elements into the system and connect them with the system using given connectors.
(Inherited from MEPSystem)
AddToCircuit | Add a set of exist components to the Electrical System.
ArePhasesModifiable |  Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.
(Inherited from Element)
CanBeHidden | Indicates if the element can be hidden in the view.
(Inherited from Element)
CanBeLocked |  Identifies if the element can be locked.
(Inherited from Element)
CanDeleteSubelement |  Checks if given subelement can be removed from the element.
(Inherited from Element)
CanHaveTypeAssigned() |  Identifies if the element can have a type assigned.
(Inherited from Element)
ChangeTypeId(ElementId) |  Changes the type of the element.
(Inherited from Element)
Create(Connector, ElectricalSystemType) |  Creates a new MEP Electrical System element from an unused Connector.
Create(Document, IList<ElementId>, ElectricalSystemType) |  Creates a new MEP Electrical System element from a set of electrical components.
DeleteEntity |  Deletes the existing entity created by %schema% in the element
(Inherited from Element)
DeleteSubelement |  Removes a subelement from the element.
(Inherited from Element)
DeleteSubelements |  Removes the subelements from the element.
(Inherited from Element)
DisconnectPanel |  Disconnect the panel for the Electrical System.
Dispose
(Inherited from Element)
DivideSystem |  Divide the phyisical networks in the system and create a new system for each network.
(Inherited from MEPSystem)
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
EvaluateAllParameterValues |  Evaluates all the parameters' values of the element.
(Inherited from Element)
EvaluateParameterValues |  Evaluate the parameters' values of the element on the given parameter ID set.
(Inherited from Element)
GetCircuitPath |  Gets the list of the electrical system circuit path node position.
GetCriticalPathSectionNumbers |  Obtains a list of the critical path section numbers.
(Inherited from MEPSystem)
GetDependentElements |  Get all elements that, from a logical point of view, are the children of this Element.
(Inherited from Element)
GetEntity |  Returns the existing entity corresponding to the Schema if it has been saved in the Element, or an invalid entity otherwise.
(Inherited from Element)
GetEntitySchemaGuids |  Returns the Schema guids of any Entities stored in this element.
(Inherited from Element)
GetExternalFileReference |  Gets information pertaining to the external file referenced by the element.
(Inherited from Element)
GetExternalResourceReference |  Gets the ExternalResourceReference associated with a specified external resource type.
(Inherited from Element)
GetExternalResourceReferenceExpanded |  Gets the collection of ExternalResourceReference associated with a specified external resource type.
(Inherited from Element)
GetExternalResourceReferences |  Gets the map of the external resource references referenced by the element.
(Inherited from Element)
GetExternalResourceReferencesExpanded |  Gets the expanded map of the external resource references referenced by the element.
(Inherited from Element)
GetGeneratingElementIds |  Returns the ids of the element(s) that generated the input geometry object.
(Inherited from Element)
GetGeometryObjectFromReference |  Retrieve one geometric primitive contained in the element given a reference.
(Inherited from Element)
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetMaterialArea |  Gets the area of the material with the given id.
(Inherited from Element)
GetMaterialIds |  Gets the element ids of all materials present in the element.
(Inherited from Element)
GetMaterialVolume |  Gets the volume of the material with the given id.
(Inherited from Element)
GetMonitoredLinkElementIds |  Provides the link instance IDs when the element is monitoring.
(Inherited from Element)
GetMonitoredLocalElementIds |  Provides the local element IDs when the element is monitoring.
(Inherited from Element)
GetOrderedParameters |  Gets the parameters associated to the element in order.
(Inherited from Element)
GetParameter | Retrieves a parameter from the element given identifier.
(Inherited from Element)
GetParameterFormatOptions |  Returns a FormatOptions override for the element Parameter, or a default FormatOptions if no override exists.
(Inherited from Element)
GetParameters | Retrieves the parameters from the element via the given name.
(Inherited from Element)
GetPhaseStatus |  Gets the status of a given element in the input phase
(Inherited from Element)
GetPhysicalNetworksNumber |  Get the physical networks number in the system.
(Inherited from MEPSystem)
GetSectionByIndex |  Get the section from the index.
(Inherited from MEPSystem)
GetSectionByNumber |  Get the Section from section number
(Inherited from MEPSystem)
GetSubelements |  Returns the collection of element subelements.
(Inherited from Element)
GetType | Gets the Type of the current instance.
(Inherited from Object)
GetTypeId |  Returns the identifier of this element's type.
(Inherited from Element)
GetValidTypes() |  Obtains a set of types that are valid for this element.
(Inherited from Element)
HasPhases |  Returns true if this Element has the properties CreatedPhaseId and DemolishedPhaseId.
(Inherited from Element)
IsCircuitPathValid |  Checks whether the list of the electrical system circuit path node position is valid.
IsCreatedPhaseOrderValid |  Returns true if createdPhaseId and demolishedPhaseId are in order.
(Inherited from Element)
IsDemolishedPhaseOrderValid |  Returns true if createdPhaseId and demolishedPhaseId are in order.
(Inherited from Element)
IsExternalFileReference |  Determines whether this Element represents an external file.
(Inherited from Element)
IsHidden | Identifies if the element has been permanently hidden in the view.
(Inherited from Element)
IsMonitoringLinkElement |  Indicate whether an element is monitoring any elements in any linked models.
(Inherited from Element)
IsMonitoringLocalElement |  Indicate whether an element is monitoring other local elements.
(Inherited from Element)
IsPhaseCreatedValid |  Returns true if createdPhaseId is an allowed value for the property CreatedPhaseId in this Element.
(Inherited from Element)
IsPhaseDemolishedValid |  Returns true if demolishedPhaseId is an allowed value for the property DemolishedPhaseId in this Element.
(Inherited from Element)
IsSystemDividable |  Checks if the system is dividable. The system is dividable if there is more than one physical network in the system. Currently, only HVAC and piping systems support dividing.
(Inherited from MEPSystem)
IsValidType(ElementId) |  Checks if given type is valid for this element.
(Inherited from Element)
LookupParameter | Attempts to find a parameter on the element which has the given name.
(Inherited from Element)
NewWires |  Create a bunch of wires for the electrical system.
RefersToExternalResourceReference |  Determines whether this Element uses external resources associated with a specified external resource type.
(Inherited from Element)
RefersToExternalResourceReferences |  Determines whether this Element uses external resources.
(Inherited from Element)
Remove(ConnectorSet) | Removes connectors from system.
(Inherited from MEPSystem)
Remove(ICollection<ElementId>) | Remove elements from system.
(Inherited from MEPSystem)
RemoveFromCircuit | remove a set of exist components from the Electrical System.
SelectPanel |  Set the panel for the Electrical System.
SetCircuitPath |  Sets the electrical system circuit path by the list of node position.
SetEntity |  Stores the entity in the element. If an Entity described by the same Schema already exists, it is overwritten.
(Inherited from Element)
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
Remarks
 The Electrical System object can only be queried in Autodesk Revit MEP.
See Also
Reference
Autodesk.Revit.DB.Electrical Namespace